Revit 2026 API

# IConnectorCoordinateSystem Property

---

The coordinate system of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
Transform CoordinateSystem { get; }
```
```vb
ReadOnly Property CoordinateSystem As Transform
	Get
```
```cpp
property Transform^ CoordinateSystem {
	Transform^ get ();
}
```
```fsharp
abstract CoordinateSystem : Transform with get
```

#### Property Value

Transform

The Z axis of the coordinate system is the normal to the plane of the connector.

#### Reference

IConnector Interface

Autodesk.Revit.DB Namespace